Ran Apply for dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/secret/volatile-lru-ca-cert` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert`

<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert...

07:56:25.278 WARN   The following strict control(s) are already completed: skip-dependencies-inputs. Please remove any completed strict controls, as setting them no longer does anything. For a list of all ongoing strict controls, and the outcomes of previous strict controls, see https://terragrunt.gruntwork.io/docs/reference/strict-mode or get the actual list by running the `terragrunt info strict` command.
07:56:29.555 INFO   Downloading Terraform configurations from ../../../../../../../../modules/secret-manager into ./.terragrunt-cache/grJXYBO0RtFfgOqjgXGsXkKMzv4/xkIDp7T7w_q-woQDhROSQmZgARo
07:56:29.611 INFO   terraform1.13.3: Initializing the backend...
07:56:30.353 INFO   terraform1.13.3: 
07:56:30.353 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
07:56:30.353 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
07:56:30.641 INFO   terraform1.13.3: Initializing provider plugins...
07:56:30.641 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 6.0.0"...
07:56:30.855 INFO   terraform1.13.3: - Using hashicorp/google v7.17.0 from the shared cache directory
07:56:31.194 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
07:56:31.195 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
07:56:31.195 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
07:56:31.195 INFO   terraform1.13.3: you run "terraform init" in the future.
07:56:31.196 INFO   terraform1.13.3: ╷
07:56:31.196 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
07:56:31.196 INFO   terraform1.13.3: │ 
07:56:31.196 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
07:56:31.197 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
07:56:31.197 INFO   terraform1.13.3: │   - hashicorp/google
07:56:31.197 INFO   terraform1.13.3: │ 
07:56:31.197 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
07:56:31.197 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
07:56:31.197 INFO   terraform1.13.3: │ these providers.
07:56:31.197 INFO   terraform1.13.3: │ 
07:56:31.197 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
07:56:31.198 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
07:56:31.198 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
07:56:31.198 INFO   terraform1.13.3: ╵
07:56:31.198 INFO   terraform1.13.3: Terraform has been successfully initialized!
07:56:34.901 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
07:56:34.901 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
07:56:34.901 STDOUT terraform1.13.3:   + create
07:56:34.901 STDOUT terraform1.13.3: Terraform will perform the following actions:
07:56:34.901 STDOUT terraform1.13.3:   # google_secret_manager_secret.secret will be created
07:56:34.901 STDOUT terraform1.13.3:   + resource "google_secret_manager_secret" "secret" {
07:56:34.901 STDOUT terraform1.13.3:       + create_time           = (known after apply)
07:56:34.901 STDOUT terraform1.13.3:       + deletion_protection   = false
07:56:34.902 STDOUT terraform1.13.3:       + effective_annotations = (known after apply)
07:56:34.902 STDOUT terraform1.13.3:       + effective_labels      = {
07:56:34.902 STDOUT terraform1.13.3:           + "component"                  = "secret"
07:56:34.902 STDOUT terraform1.13.3:           + "environment"                = "stg"
07:56:34.902 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
07:56:34.902 STDOUT terraform1.13.3:           + "managed_by"                 = "atlantis"
07:56:34.903 STDOUT terraform1.13.3:           + "org"                        = "nz3es"
07:56:34.903 STDOUT terraform1.13.3:           + "plane"                      = "data-plane"
07:56:34.903 STDOUT terraform1.13.3:           + "project"                    = "iac-01"
07:56:34.903 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
07:56:34.903 STDOUT terraform1.13.3:         }
07:56:34.903 STDOUT terraform1.13.3:       + expire_time           = (known after apply)
07:56:34.903 STDOUT terraform1.13.3:       + id                    = (known after apply)
07:56:34.904 STDOUT terraform1.13.3:       + labels                = {
07:56:34.904 STDOUT terraform1.13.3:           + "component"   = "secret"
07:56:34.904 STDOUT terraform1.13.3:           + "environment" = "stg"
07:56:34.904 STDOUT terraform1.13.3:           + "managed_by"  = "atlantis"
07:56:34.904 STDOUT terraform1.13.3:           + "org"         = "nz3es"
07:56:34.904 STDOUT terraform1.13.3:           + "plane"       = "data-plane"
07:56:34.904 STDOUT terraform1.13.3:           + "project"     = "iac-01"
07:56:34.904 STDOUT terraform1.13.3:           + "region"      = "australia-southeast2"
07:56:34.904 STDOUT terraform1.13.3:         }
07:56:34.904 STDOUT terraform1.13.3:       + name                  = (known after apply)
07:56:34.905 STDOUT terraform1.13.3:       + project               = "iac-01"
07:56:34.905 STDOUT terraform1.13.3:       + secret_id             = "volatile-lru-ca-cert"
07:56:34.905 STDOUT terraform1.13.3:       + terraform_labels      = {
07:56:34.905 STDOUT terraform1.13.3:           + "component"                  = "secret"
07:56:34.905 STDOUT terraform1.13.3:           + "environment"                = "stg"
07:56:34.905 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
07:56:34.905 STDOUT terraform1.13.3:           + "managed_by"                 = "atlantis"
07:56:34.906 STDOUT terraform1.13.3:           + "org"                        = "nz3es"
07:56:34.906 STDOUT terraform1.13.3:           + "plane"                      = "data-plane"
07:56:34.906 STDOUT terraform1.13.3:           + "project"                    = "iac-01"
07:56:34.906 STDOUT terraform1.13.3:           + "region"                     = "australia-southeast2"
07:56:34.906 STDOUT terraform1.13.3:         }
07:56:34.906 STDOUT terraform1.13.3:       + replication {
07:56:34.906 STDOUT terraform1.13.3:           + auto {
07:56:34.906 STDOUT terraform1.13.3:             }
07:56:34.906 STDOUT terraform1.13.3:         }
07:56:34.906 STDOUT terraform1.13.3:     }
07:56:34.906 STDOUT terraform1.13.3:   # google_secret_manager_secret_version.version will be created
07:56:34.906 STDOUT terraform1.13.3:   + resource "google_secret_manager_secret_version" "version" {
07:56:34.907 STDOUT terraform1.13.3:       + create_time            = (known after apply)
07:56:34.907 STDOUT terraform1.13.3:       + deletion_policy        = "DELETE"
07:56:34.907 STDOUT terraform1.13.3:       + destroy_time           = (known after apply)
07:56:34.907 STDOUT terraform1.13.3:       + enabled                = true
07:56:34.907 STDOUT terraform1.13.3:       + id                     = (known after apply)
07:56:34.907 STDOUT terraform1.13.3:       + name                   = (known after apply)
07:56:34.907 STDOUT terraform1.13.3:       + project                = (known after apply)
07:56:34.908 STDOUT terraform1.13.3:       + secret                 = (known after apply)
07:56:34.908 STDOUT terraform1.13.3:       + secret_data            = (sensitive value)
07:56:34.908 STDOUT terraform1.13.3:       + secret_data_wo         = (write-only attribute)
07:56:34.908 STDOUT terraform1.13.3:       + secret_data_wo_version = 0
07:56:34.908 STDOUT terraform1.13.3:       + version                = (known after apply)
07:56:34.908 STDOUT terraform1.13.3:     }
07:56:34.908 STDOUT terraform1.13.3: Plan: 2 to add, 0 to change, 0 to destroy.
07:56:34.908 STDOUT terraform1.13.3: 
07:56:34.908 STDOUT terraform1.13.3: Changes to Outputs:
07:56:34.908 STDOUT terraform1.13.3:   + secret_name = (known after apply)
07:56:34.908 STDOUT terraform1.13.3:   + version     = (known after apply)
07:56:35.821 STDOUT terraform1.13.3: google_secret_manager_secret.secret: Creating...
07:56:38.080 STDOUT terraform1.13.3: google_secret_manager_secret.secret: Creation complete after 2s [id=projects/iac-01/secrets/volatile-lru-ca-cert]
07:56:38.086 STDOUT terraform1.13.3: google_secret_manager_secret_version.version: Creating...
07:56:43.151 STDOUT terraform1.13.3: google_secret_manager_secret_version.version: Creation complete after 5s [id=projects/834266050147/secrets/volatile-lru-ca-cert/versions/1]
07:56:43.349 STDOUT terraform1.13.3: 
07:56:43.349 STDOUT terraform1.13.3: Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
07:56:43.350 STDOUT terraform1.13.3: 
07:56:43.350 STDOUT terraform1.13.3: Outputs:
07:56:43.350 STDOUT terraform1.13.3: secret_id = "volatile-lru-ca-cert"
07:56:43.350 STDOUT terraform1.13.3: secret_name = "projects/iac-01/secrets/volatile-lru-ca-cert"
07:56:43.350 STDOUT terraform1.13.3: version = "projects/834266050147/secrets/volatile-lru-ca-cert/versions/1"
```

</details>